{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 4, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6, null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Concatenate", "config": {"name": "concatenate_21", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_21", "inbound_nodes": [[["input_7", 0, 0, {}], ["input_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_60", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_60", "inbound_nodes": [[["concatenate_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_61", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_61", "inbound_nodes": [[["conv2d_60", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_36", "inbound_nodes": [[["conv2d_61", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_62", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_62", "inbound_nodes": [[["activation_36", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_18", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_average_pooling2d_18", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_18", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_max_pooling2d_18", "inbound_nodes": [[["conv2d_62", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_36", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_36", "inbound_nodes": [[["global_average_pooling2d_18", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_37", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_37", "inbound_nodes": [[["global_max_pooling2d_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_36", "inbound_nodes": [[["reshape_36", 0, 0, {}]], [["reshape_37", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_37", "inbound_nodes": [[["dense_36", 0, 0, {}]], [["dense_36", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_39", "trainable": true, "dtype": "float32"}, "name": "add_39", "inbound_nodes": [[["dense_37", 0, 0, {}], ["dense_37", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_37", "inbound_nodes": [[["add_39", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_54", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_54", "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_36", "trainable": true, "dtype": "float32"}, "name": "multiply_36", "inbound_nodes": [[["conv2d_62", 0, 0, {}], ["permute_54", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_55", "trainable": true, "dtype": "float32", "dims": [2, 3, 1]}, "name": "permute_55", "inbound_nodes": [[["multiply_36", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_54", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6FC4uL3V0aWxzL0RTZW4yTmV0LnB5\n2gg8bGFtYmRhPlAAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_54", "inbound_nodes": [[["permute_55", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_55", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoULi4vdXRpbHMvRFNlbjJOZXQucHna\nCDxsYW1iZGE+UgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_55", "inbound_nodes": [[["permute_55", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_22", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_22", "inbound_nodes": [[["lambda_54", 0, 0, {}], ["lambda_55", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_56", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_56", "inbound_nodes": [[["concatenate_22", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_63", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_63", "inbound_nodes": [[["permute_56", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_37", "trainable": true, "dtype": "float32"}, "name": "multiply_37", "inbound_nodes": [[["multiply_36", 0, 0, {}], ["conv2d_63", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_56", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA\nAPoULi4vdXRpbHMvRFNlbjJOZXQucHnaCDxsYW1iZGE+fgAAAPMAAAAA\n", null, [0.1]], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_56", "inbound_nodes": [[["multiply_37", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_40", "trainable": true, "dtype": "float32"}, "name": "add_40", "inbound_nodes": [[["conv2d_60", 0, 0, {}], ["lambda_56", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_64", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_64", "inbound_nodes": [[["add_40", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_38", "inbound_nodes": [[["conv2d_64", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_65", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_65", "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_19", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_average_pooling2d_19", "inbound_nodes": [[["conv2d_65", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_19", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_max_pooling2d_19", "inbound_nodes": [[["conv2d_65", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_38", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_38", "inbound_nodes": [[["global_average_pooling2d_19", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_39", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_39", "inbound_nodes": [[["global_max_pooling2d_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_38", "inbound_nodes": [[["reshape_38", 0, 0, {}]], [["reshape_39", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_39", "inbound_nodes": [[["dense_38", 0, 0, {}]], [["dense_38", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_41", "trainable": true, "dtype": "float32"}, "name": "add_41", "inbound_nodes": [[["dense_39", 0, 0, {}], ["dense_39", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_39", "inbound_nodes": [[["add_41", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_57", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_57", "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_38", "trainable": true, "dtype": "float32"}, "name": "multiply_38", "inbound_nodes": [[["conv2d_65", 0, 0, {}], ["permute_57", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_58", "trainable": true, "dtype": "float32", "dims": [2, 3, 1]}, "name": "permute_58", "inbound_nodes": [[["multiply_38", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_57", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6FC4uL3V0aWxzL0RTZW4yTmV0LnB5\n2gg8bGFtYmRhPlAAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_57", "inbound_nodes": [[["permute_58", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_58", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoULi4vdXRpbHMvRFNlbjJOZXQucHna\nCDxsYW1iZGE+UgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_58", "inbound_nodes": [[["permute_58", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_23", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_23", "inbound_nodes": [[["lambda_57", 0, 0, {}], ["lambda_58", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_59", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_59", "inbound_nodes": [[["concatenate_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_66", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_66", "inbound_nodes": [[["permute_59", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_39", "trainable": true, "dtype": "float32"}, "name": "multiply_39", "inbound_nodes": [[["multiply_38", 0, 0, {}], ["conv2d_66", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_59", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA\nAPoULi4vdXRpbHMvRFNlbjJOZXQucHnaCDxsYW1iZGE+fgAAAPMAAAAA\n", null, [0.1]], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_59", "inbound_nodes": [[["multiply_39", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_42", "trainable": true, "dtype": "float32"}, "name": "add_42", "inbound_nodes": [[["add_40", 0, 0, {}], ["lambda_59", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_67", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_67", "inbound_nodes": [[["add_42", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_40", "inbound_nodes": [[["conv2d_67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_68", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_68", "inbound_nodes": [[["activation_40", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_20", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_average_pooling2d_20", "inbound_nodes": [[["conv2d_68", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_20", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_max_pooling2d_20", "inbound_nodes": [[["conv2d_68", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_40", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_40", "inbound_nodes": [[["global_average_pooling2d_20", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_41", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_41", "inbound_nodes": [[["global_max_pooling2d_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_40", "inbound_nodes": [[["reshape_40", 0, 0, {}]], [["reshape_41", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_41", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_41", "inbound_nodes": [[["dense_40", 0, 0, {}]], [["dense_40", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_43", "trainable": true, "dtype": "float32"}, "name": "add_43", "inbound_nodes": [[["dense_41", 0, 0, {}], ["dense_41", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_41", "inbound_nodes": [[["add_43", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_60", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_60", "inbound_nodes": [[["activation_41", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_40", "trainable": true, "dtype": "float32"}, "name": "multiply_40", "inbound_nodes": [[["conv2d_68", 0, 0, {}], ["permute_60", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_61", "trainable": true, "dtype": "float32", "dims": [2, 3, 1]}, "name": "permute_61", "inbound_nodes": [[["multiply_40", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_60", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6FC4uL3V0aWxzL0RTZW4yTmV0LnB5\n2gg8bGFtYmRhPlAAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_60", "inbound_nodes": [[["permute_61", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_61", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoULi4vdXRpbHMvRFNlbjJOZXQucHna\nCDxsYW1iZGE+UgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_61", "inbound_nodes": [[["permute_61", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_24", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_24", "inbound_nodes": [[["lambda_60", 0, 0, {}], ["lambda_61", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_62", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_62", "inbound_nodes": [[["concatenate_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_69", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_69", "inbound_nodes": [[["permute_62", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_41", "trainable": true, "dtype": "float32"}, "name": "multiply_41", "inbound_nodes": [[["multiply_40", 0, 0, {}], ["conv2d_69", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_62", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA\nAPoULi4vdXRpbHMvRFNlbjJOZXQucHnaCDxsYW1iZGE+fgAAAPMAAAAA\n", null, [0.1]], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_62", "inbound_nodes": [[["multiply_41", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_44", "trainable": true, "dtype": "float32"}, "name": "add_44", "inbound_nodes": [[["add_42", 0, 0, {}], ["lambda_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_70", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_70", "inbound_nodes": [[["add_44", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_42", "inbound_nodes": [[["conv2d_70", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_71", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_71", "inbound_nodes": [[["activation_42", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_21", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_average_pooling2d_21", "inbound_nodes": [[["conv2d_71", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_21", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_max_pooling2d_21", "inbound_nodes": [[["conv2d_71", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_42", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_42", "inbound_nodes": [[["global_average_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_43", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_43", "inbound_nodes": [[["global_max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_42", "inbound_nodes": [[["reshape_42", 0, 0, {}]], [["reshape_43", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_43", "inbound_nodes": [[["dense_42", 0, 0, {}]], [["dense_42", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_45", "trainable": true, "dtype": "float32"}, "name": "add_45", "inbound_nodes": [[["dense_43", 0, 0, {}], ["dense_43", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_43", "inbound_nodes": [[["add_45", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_63", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_63", "inbound_nodes": [[["activation_43", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_42", "trainable": true, "dtype": "float32"}, "name": "multiply_42", "inbound_nodes": [[["conv2d_71", 0, 0, {}], ["permute_63", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_64", "trainable": true, "dtype": "float32", "dims": [2, 3, 1]}, "name": "permute_64", "inbound_nodes": [[["multiply_42", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_63", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6FC4uL3V0aWxzL0RTZW4yTmV0LnB5\n2gg8bGFtYmRhPlAAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_63", "inbound_nodes": [[["permute_64", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_64", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoULi4vdXRpbHMvRFNlbjJOZXQucHna\nCDxsYW1iZGE+UgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_64", "inbound_nodes": [[["permute_64", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_25", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_25", "inbound_nodes": [[["lambda_63", 0, 0, {}], ["lambda_64", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_65", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_65", "inbound_nodes": [[["concatenate_25", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_72", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_72", "inbound_nodes": [[["permute_65", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_43", "trainable": true, "dtype": "float32"}, "name": "multiply_43", "inbound_nodes": [[["multiply_42", 0, 0, {}], ["conv2d_72", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_65", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA\nAPoULi4vdXRpbHMvRFNlbjJOZXQucHnaCDxsYW1iZGE+fgAAAPMAAAAA\n", null, [0.1]], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_65", "inbound_nodes": [[["multiply_43", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_46", "trainable": true, "dtype": "float32"}, "name": "add_46", "inbound_nodes": [[["add_44", 0, 0, {}], ["lambda_65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_73", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_73", "inbound_nodes": [[["add_46", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_44", "inbound_nodes": [[["conv2d_73", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_74", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_74", "inbound_nodes": [[["activation_44", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_22", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_average_pooling2d_22", "inbound_nodes": [[["conv2d_74", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_22", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_max_pooling2d_22", "inbound_nodes": [[["conv2d_74", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_44", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_44", "inbound_nodes": [[["global_average_pooling2d_22", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_45", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_45", "inbound_nodes": [[["global_max_pooling2d_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_44", "inbound_nodes": [[["reshape_44", 0, 0, {}]], [["reshape_45", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_45", "inbound_nodes": [[["dense_44", 0, 0, {}]], [["dense_44", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_47", "trainable": true, "dtype": "float32"}, "name": "add_47", "inbound_nodes": [[["dense_45", 0, 0, {}], ["dense_45", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_45", "inbound_nodes": [[["add_47", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_66", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_66", "inbound_nodes": [[["activation_45", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_44", "trainable": true, "dtype": "float32"}, "name": "multiply_44", "inbound_nodes": [[["conv2d_74", 0, 0, {}], ["permute_66", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_67", "trainable": true, "dtype": "float32", "dims": [2, 3, 1]}, "name": "permute_67", "inbound_nodes": [[["multiply_44", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_66", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6FC4uL3V0aWxzL0RTZW4yTmV0LnB5\n2gg8bGFtYmRhPlAAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_66", "inbound_nodes": [[["permute_67", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_67", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoULi4vdXRpbHMvRFNlbjJOZXQucHna\nCDxsYW1iZGE+UgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_67", "inbound_nodes": [[["permute_67", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_26", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_26", "inbound_nodes": [[["lambda_66", 0, 0, {}], ["lambda_67", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_68", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_68", "inbound_nodes": [[["concatenate_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_75", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_75", "inbound_nodes": [[["permute_68", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_45", "trainable": true, "dtype": "float32"}, "name": "multiply_45", "inbound_nodes": [[["multiply_44", 0, 0, {}], ["conv2d_75", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_68", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA\nAPoULi4vdXRpbHMvRFNlbjJOZXQucHnaCDxsYW1iZGE+fgAAAPMAAAAA\n", null, [0.1]], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_68", "inbound_nodes": [[["multiply_45", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_48", "trainable": true, "dtype": "float32"}, "name": "add_48", "inbound_nodes": [[["add_46", 0, 0, {}], ["lambda_68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_76", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_76", "inbound_nodes": [[["add_48", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_46", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_46", "inbound_nodes": [[["conv2d_76", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_77", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_77", "inbound_nodes": [[["activation_46", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_23", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_average_pooling2d_23", "inbound_nodes": [[["conv2d_77", 0, 0, {}]]]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_23", "trainable": true, "dtype": "float32", "data_format": "channels_first", "keepdims": false}, "name": "global_max_pooling2d_23", "inbound_nodes": [[["conv2d_77", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_46", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_46", "inbound_nodes": [[["global_average_pooling2d_23", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_47", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 128]}, "name": "reshape_47", "inbound_nodes": [[["global_max_pooling2d_23", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_46", "inbound_nodes": [[["reshape_46", 0, 0, {}]], [["reshape_47", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_47", "inbound_nodes": [[["dense_46", 0, 0, {}]], [["dense_46", 1, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_49", "trainable": true, "dtype": "float32"}, "name": "add_49", "inbound_nodes": [[["dense_47", 0, 0, {}], ["dense_47", 1, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "name": "activation_47", "inbound_nodes": [[["add_49", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_69", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_69", "inbound_nodes": [[["activation_47", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_46", "trainable": true, "dtype": "float32"}, "name": "multiply_46", "inbound_nodes": [[["conv2d_77", 0, 0, {}], ["permute_69", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_70", "trainable": true, "dtype": "float32", "dims": [2, 3, 1]}, "name": "permute_70", "inbound_nodes": [[["multiply_46", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_69", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaBG1lYW4pAdoBeKkAcgcAAAD6FC4uL3V0aWxzL0RTZW4yTmV0LnB5\n2gg8bGFtYmRhPlAAAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_69", "inbound_nodes": [[["permute_70", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_70", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6f////9UKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPoULi4vdXRpbHMvRFNlbjJOZXQucHna\nCDxsYW1iZGE+UgAAAPMAAAAA\n", null, null], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_70", "inbound_nodes": [[["permute_70", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_27", "trainable": true, "dtype": "float32", "axis": 3}, "name": "concatenate_27", "inbound_nodes": [[["lambda_69", 0, 0, {}], ["lambda_70", 0, 0, {}]]]}, {"class_name": "Permute", "config": {"name": "permute_71", "trainable": true, "dtype": "float32", "dims": [3, 1, 2]}, "name": "permute_71", "inbound_nodes": [[["concatenate_27", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_78", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_78", "inbound_nodes": [[["permute_71", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "multiply_47", "trainable": true, "dtype": "float32"}, "name": "multiply_47", "inbound_nodes": [[["multiply_46", 0, 0, {}], ["conv2d_78", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_71", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAIAAAATAAAAcwgAAAB8AIgAFABTACkBTqkAKQHaAXgpAdoFc2NhbGVyAQAA\nAPoULi4vdXRpbHMvRFNlbjJOZXQucHnaCDxsYW1iZGE+fgAAAPMAAAAA\n", null, [0.1]], "function_type": "lambda", "module": "utils.DSen2Net", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_71", "inbound_nodes": [[["multiply_47", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_50", "trainable": true, "dtype": "float32"}, "name": "add_50", "inbound_nodes": [[["add_48", 0, 0, {}], ["lambda_71", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_79", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_79", "inbound_nodes": [[["add_50", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_51", "trainable": true, "dtype": "float32"}, "name": "add_51", "inbound_nodes": [[["conv2d_79", 0, 0, {}], ["input_8", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["add_51", 0, 0]]}, "keras_version": "2.10.0", "backend": "tensorflow"}